function [I,E,deltaX,deltaY,sigma,enumBearing] = constant(enum)
psi = 1.664/1000; % Относительный горизонтальный зазор
l = 0.21; % Длина вкладыша
omega = 314; % Частота вращения
mu = 0.1515; % Динамическая вязкость смазки

% Задание констант 
if enum == 0 % Для эллиптического подшипника 
    enumBearing = 0;
    I(1) = 7.626; I(2) = -24.562;
    I(3) = 10; I(4) = 60.588;
    I(5) = 10.488; I(6) = 1.323;
    I(7) = 1.284; I(8) = 73.156;
    E = 59.69;
    deltaX=0.001; deltaY = 0.0001;
    sigma = 1.67;
end

if enum == 1 % Для сегментного подшипника
    enumBearing = 1;
    I(1) = 2.546; I(2) = 0;
    I(3) = 0; I(4) = 5.26;
    I(5) = 2.23; I(6) = 0;
    I(7) = 0; I(8) = 4.293;
    E = 3.638;
    deltaX=0.0002912; deltaY = 0.00005824;
    sigma = 1.67;
end

if enum == 2 % Для сегментного подшипника статическая нагрузка 80%
    enumBearing = 1;
    I(1) = 2.546; I(2) = 0;
    I(3) = 0; I(4) = 5.26;
    I(5) = 2.23; I(6) = 0;
    I(7) = 0; I(8) = 4.293;
    E = 3.638;
    deltaX=0.0002912; deltaY = 0.00005824;
    sigma = 1.67;
end

if enum == 3 % Для сегментного подшипника без статической нагрузки
    enumBearing = 1;
    I(1) = 2.546; I(2) = 0;
    I(3) = 0; I(4) = 5.26;
    I(5) = 2.23; I(6) = 0;
    I(7) = 0; I(8) = 4.293;
    E = 3.638;
    deltaX=0.0002912; deltaY = 0.00005824;
    sigma = 1.67;
end
