function [I,E,deltaX,deltaY,sigma,enumBearing] = constant(enum)
% Задание констант 
if enum == 0 % Для эллиптического подшипника 
    enumBearing = 0;
    I(1) = 7.626; I(2) = -24.562;
    I(3) = 10; I(4) = 60.588;
    I(5) = 10.488; I(6) = 1.323;
    I(7) = 1.284; I(8) = 73.156;
    E = 59.69;
    deltaX=0.001; deltaY = 0.0001;
    sigma = 1.67;
end
if enum == 1 % Для эллиптического подшипника массы 12600 
    enumBearing = 0;
    %2,119
    I(1) = 5.073; I(2) = -16.961;
    I(3) = 11.607; I(4) = 46.203;
    I(5) = 9.059; I(6) = 6.338;
    I(7) = 6.336; I(8) = 57.987;
    E = 41.783;
    deltaX=0.001; deltaY = 0.0001;
    sigma = 1.67;
end
if enum == 2 % Для эллиптического подшипника массы 0
    enumBearing = 0;
    I(1) = 1.674; I(2) = -8.323;
    I(3) = 12.808; I(4) = 27.763;
    I(5) = 6.324; I(6) = 11.901;
    I(7) = 11.872; I(8) = 42.259;
    E = 0;
    deltaX=0.001; deltaY = 0.0001;
    sigma = 1.67;
end
if enum == 3 % Для сегментного подшипника
    enumBearing = 1;
    I(1) = 2.546; I(2) = 0;
    I(3) = 0; I(4) = 5.26;
    I(5) = 2.23; I(6) = 0;
    I(7) = 0; I(8) = 4.293;
    E = 3.638;
    deltaX=0.0002912; deltaY = 0.00005824;
    sigma = 1.67;
end
if enum == 4 % Сегментный подшипник массы 5600 кг
    enumBearing = 1;
    I(1) = 1.909; I(2) = 0;
    I(3) = 0; I(4) = 3.347;
    I(5) = 1.767; I(6) = 0;
    I(7) = 0; I(8) = 2.905;
    E = 2.547;
    deltaX=0.0002912; deltaY = 0.00005824;
    sigma = 1.67;
end
if enum == 5 % Сегментный подшипник массы 0 кг
    enumBearing = 1;
    I(1) = 1.1; I(2) = 0;
    I(3) = 0; I(4) = 1.1;
    I(5) = 1.199; I(6) = 0;
    I(7) = 0; I(8) = 1.199;
    E = 0;
    deltaX=0.0002912; deltaY = 0.00005824;
    sigma = 1.67;
end

